Smartrek/spidermesh_gateway_esp32/src/spidermeshapi.cpp
    for(int i=0; i<5; i++)
    {
        ret.push_back(cmd[i]);
    } 
    return ret;
}

apiframe SpidermeshApi::setDyn(uint8_t po, uint8_t pi,uint8_t hop, uint8_t rdx, uint8_t rde, uint8_t duty)
{
    uint8_t cmd[10] = {0xFB, 7, 0, 0x0A, po, pi, hop, rdx, rde, duty};

    apiframe ret;
    for(int i=0; i<10; i++)
    {
        ret.push_back(cmd[i]);
    } 
    return ret;   
}

apiframe SpidermeshApi::requestMacAddress()
{
    Serial.println("==Request Gateway Mac Address");
    uint8_t cmd[20] = {0xFB, 4, 0, 3, 2,0,8};

    apiframe ret;
    for(int i=0; i<7; i++)
    {
        ret.push_back(cmd[i]);
    } 
    return ret;   
}

//-----------------------------------------------------------------------------------------------
void SpidermeshApi::task()
{
    //manage serial port reception
    if(!parseReceivedData());


}




//------------------------------------------------------------------------------------------------
void SpidermeshApi::initWatchdogParser()
{
    watchdog_serial_parser = true;
    previousMillisPacketParser = millis();
    //LedRemoteOn();
}

//------------------------------------------------------------------------------------------------
void SpidermeshApi::disableWatchdogParser()
{
    watchdog_serial_parser = false;
    //LedRemoteOff();
}


//------------------------------------------------------------------------------------------------
bool SpidermeshApi::parseReceivedData()
{
    bool ret = false;
    if (smkport.available())
    {
        ret = true;
        unsigned char rx = smkport.read();
        //Serial.write(state_serial); //debug line
        //Serial.write(rx);

      #if SHOW_RECEIVED_BYTE_FROM_SMK900
        char result2[10];
        sprintf(result2, "%02X ", rx);
        Serial.print(result2);
      #endif

        switch (state_serial)
        {
            case STATE_SOF:
                if (rx == 0xFB)
                {
                    state_serial = STATE_LENGTH;
                    idx_buf = 0;
                    length_packet = 0;
                    current_packet.clear();
                    current_packet.push_back(rx);
                    idx_buf++;
                    initWatchdogParser();
                }
                break;
            case STATE_LENGTH:
                if (length_packet == 0){
                    current_packet.push_back(rx);
                    idx_buf++;
                    length_packet += rx;
                }
                else
                {
                    current_packet.push_back(rx);
                    idx_buf++;
                    length_packet += rx*256;
                    state_serial = STATE_DATA; 
                }
                break;
            case STATE_DATA:
                //read serial port char
                current_packet.push_back(rx);
                idx_buf++;

                //Lenght of packet reach, packet ready to parse
                if (idx_buf >= length_packet+3)
                {
                    disableWatchdogParser();
                    state_serial = STATE_PACKET;
                    #if SHOW_RECEIVED_BYTE_FROM_SMK900
                        Serial.println();
                    #endif
                    bool iseob = isEobPacket(current_packet);
                    if(show_apipkt_in && !iseob) printApiPacket(current_packet, PREFIX_IN);
                    CheckIfAnswerWasExpectedAndCallSuccessFunction(current_packet);


                    timeCallbackUser = millis();
                    cbWhenPacketReceived(current_packet); //for user purpose
                    timeCallbackUser = millis() - timeCallbackUser; 

                    //IS EOB
                    if(iseob)
                    {
                        eob_cnt++; //counter manage at higher level
                        CheckExpectTimeout();
                        WhenEobIsReceived(true);
                    }
                    if(iseob) OptimalDelay();                 //delay for other thread

                  #if TERMINAL_ENABLED
                    AddToTerminalBuffer("in :", &current_packet);
                  #endif                    

                    state_serial = STATE_SOF;
                }
                break;

            default:
                state_serial = STATE_SOF;
                break;
        }
    }


    //if a message is currently beeing readed, watchdog will be activated at first character received
    //after a time without a complete packet, buffer will be flushed to get the next one.
    //this is a simple way to parse message and if parsing machine is lost.
    if (watchdog_serial_parser)
    {
        unsigned long currentMillis = millis();
        if (currentMillis - previousMillisPacketParser >= timeout_parser)
        {
            // save the last time you blinked the LED
            previousMillisPacketParser = currentMillis;
            idx_buf = 0;
            length_packet = 0;
            disableWatchdogParser();
            //LedRemoteOn();
        }
    }
    return ret;
}


//------------------------------------------------------------------------------------------------
void SpidermeshApi::OptimalDelay()
{
    if(actualMeshSpeed.hop != 0)
    {

        int tBroadcast;
        int tInterval;
        int tSleep;
        TimmingMeshCalculator(&tBroadcast, &tInterval, &tSleep);

        int secureSleep = tSleep - THREAD_DELAY_WINDOW - timeCallbackUser;

        if(secureSleep<0){
            Serial.println("Warning, callback function take too much time!");
            secureSleep = 10;
        } 
        if(secureSleep >60000) secureSleep = 60000;

        #if 0
            /*
            char msg[100];
            sprintf(msg, "Bo:%d\nBi:%d\nHops:%d\nR:%d\nRe:%d\nDuty:%d\n",actualMeshSpeed.bo,actualMeshSpeed.bi,actualMeshSpeed.hop,actualMeshSpeed.rde,actualMeshSpeed.rd,actualMeshSpeed.duty);
            Serial.print(msg);

            Serial.print("tBroadcast:");
            Serial.println(tBroadcast);
            Serial.print("tInterval:");
            Serial.println(tInterval);
            Serial.print("tSleep:");
            Serial.println(tSleep);*/
            Serial.print("  secureSleep:");
            Serial.println(secureSleep);
            Serial.print("  timeCallbackUser:");
            Serial.println(timeCallbackUser);
        #endif


        int remaining = secureSleep;
        do
        {
            delay(100);
            remaining -=100;
            if(smkport.available())
            {
                Serial.print(KRED);
                Serial.print("  SMK900 received before delay expired. Remaining expected: ");
                Serial.println(remaining);      
                Serial.print(KNRM);
                break;
            }
        } while (remaining>0);
    }
    else
    {
        delay(100);
    }
    

