Smartrek/spidermesh_gateway_esp32/src/spidermeshapi.cpp
}

//------------------------------------------------------------------------------------------------
bool SpidermeshApi::TimmingMeshCalculator(int* tbroadcat, int* tinterval, int* tsleep)
{
    bool ret = false;
    if(actualMeshSpeed.hop != 0)
    {

        *tbroadcat = 10 * (actualMeshSpeed.hop * (actualMeshSpeed.bo + actualMeshSpeed.bi) + actualMeshSpeed.rde *actualMeshSpeed.rd);
        *tinterval = *tbroadcat * actualMeshSpeed.duty;
        *tsleep = *tinterval - *tbroadcat;
        ret = true;
    }
    return ret;
}

//------------------------------------------------------------------------------------------------
void SpidermeshApi::parseApiFromHost(uint8_t* buf, uint16_t len)
{
    uint16_t id_pkt = 0;
    uint8_t state_pkt = STATE_SOF;
    static uint16_t len_pkt;
    uint16_t last_idx_packet = 0;
    commandList_t cmd_list_ok;
    apiframe cmd_pkt;


    while(id_pkt < len)
    {
        switch (state_pkt)
        {
            case STATE_SOF:
                if (buf[id_pkt] == 0xFB)
                {
                    state_pkt = STATE_LENGTH;
                    len_pkt = 0;
                    cmd_pkt.push_back(buf[id_pkt]);
                }
                id_pkt++;
                break;
            case STATE_LENGTH:
                if (len_pkt == 0){
                    cmd_pkt.push_back(buf[id_pkt]);
                    len_pkt += buf[id_pkt];
                }
                else
                { 
                    cmd_pkt.push_back(buf[id_pkt]);
                    len_pkt += ((uint16_t)buf[id_pkt])*256;
                    state_pkt = STATE_DATA; 
                }
                id_pkt++;
                break;
            case STATE_DATA:
                //read serial port char
                cmd_pkt.push_back(buf[id_pkt]);
                id_pkt++;
                
                //Lenght of packet reach, packet ready to parse
                if (id_pkt-last_idx_packet >= len_pkt+3)
                {
                    last_idx_packet= id_pkt;
                    addApiPacketLowPriority(cmd_pkt);

                    //Serial.println("  will be sent");
                    cmd_pkt.clear();
                    state_pkt = STATE_SOF;
                }
                break;

            default:
                state_pkt = STATE_SOF;
                break;
        }
    }

}





//-------------------------------
String SpidermeshApi::sendCommand(apiframe cmd)
{
    for (int i = 0; i < cmd.size(); i++){
        write(cmd[i]);
    }


    String cmd_out = hexPacketToAscii(cmd);
    #if SHOW_TRANSMITED_PACKET_TO_SMK900
    printApiPacket(cmd, "out: ");    
    //Serial.println(cmd_out);
    #endif
    #if TERMINAL_ENABLED
    AddToTerminalBuffer("out:", &cmd);
    #endif

    return cmd_out;
}

void SpidermeshApi::AddToTerminalBuffer(String head, apiframe *cmd)
{
    terminalBuffer.push_back(head +  hexPacketToAscii(*cmd));

    if (terminalBuffer.size() > NB_PACKET_TERMINAL)
        terminalBuffer.pop_front();    


}

//------------------------------------------------------------------------------------------------
// This function will poll the next on demand command
// It is taking the place of the normal base polling list
// It should be send after receiving an end of broadcast marker
//
bool SpidermeshApi::sendNextPacketBuffered()
{
    bool ret = false;
    taskENTER_CRITICAL(&mutexExpect);
    if (writeAndExpectList.size()>0 || lowPriorityFifoCommandList.size() > 0 || highPriorityFifoCommandList.size() > 0)
    {
        //send the command
    #if SHOW_TRANSMITED_PACKET_TO_SMK900 && 0
        Serial.print("on demand cmd sent: ");
    #endif
        apiframe cmd;
        if(highPriorityFifoCommandList.size() > 0)
        {
            cmd = highPriorityFifoCommandList.front();
            highPriorityFifoCommandList.pop_front();
            sendCommand(cmd);
        }
        else if(lowPriorityFifoCommandList.size() > 0)
        {
            cmd = lowPriorityFifoCommandList.front();
            lowPriorityFifoCommandList.pop_front();
            sendCommand(cmd);
        }
        else if(writeAndExpectList.size()>0)
        {
            //Serial.printf("writeAndExpectList.size():%d\r\n",writeAndExpectList.size());
            MeshRequest_t req = writeAndExpectList.front();
            writeAndExpectList.pop_front();
            cmd = req.payload;
            WriteAndExpectAnwser(req.pNode, req.payload, PACKET_VM_RESP, req.tag, req.callback);
        }

        if(show_apipkt_out)
        {
            String prefix = "  out: ";
            if(cmd[5] == 0x4E) prefix = "  broadcast: ";
            printApiPacket(cmd, prefix);
        }

        ret = true;
    }
    taskEXIT_CRITICAL(&mutexExpect);

    return ret;
}

void SpidermeshApi::ClearFifoAndExpectList()
{
    taskENTER_CRITICAL(&mutexExpect);
    writeAndExpectList.clear();
    lowPriorityFifoCommandList.clear();
    highPriorityFifoCommandList.clear();
    taskEXIT_CRITICAL(&mutexExpect);
    dumpReceivedBuffer();
}

bool SpidermeshApi::addWriteExpect(MeshRequest_t r)
{
    taskENTER_CRITICAL(&mutexExpect);
    writeAndExpectList.push_back(r);
    taskEXIT_CRITICAL(&mutexExpect);
    return true;
}

bool SpidermeshApi::addWriteExpect(mesh_t::iterator p, apiframe h, String t, ExpectCallback cb)
{
    MeshRequest_t req = {p, h, cb, t};
    addWriteExpect(req);
    return true;
}

bool SpidermeshApi::addApiPacketLowPriority(String asciiCommand)
{

    apiframe od_pkt = convertAsciiTohexCommand(asciiCommand.c_str());
    //printApiPacket(od_pkt);
    addApiPacketLowPriority(od_pkt);
    return true;
}

bool SpidermeshApi::addApiPacketLowPriority(uint8_t* buffer, int size)
{
    apiframe buf_hex;
    for(int i=0; i<size;i++)
    {
        buf_hex.push_back(buffer[i]);
    }
    addApiPacketLowPriority(buf_hex);
    return true;
}

bool SpidermeshApi::addApiPacketLowPriority(apiframe hcmd)
{
    taskENTER_CRITICAL(&mutexExpect);
    if(lowPriorityFifoCommandList.size() <= PORTIA_FIFO_LOW_PRIORITY_SIZE)
    {
#if ON_DEMAND_COMMAND_MUST_BE_DIFFERENT_FROM_THE_LAST_ONE == 1
        if(hcmd != lowPriorityFifoCommandList.back())
        {
            lowPriorityFifoCommandList.push_back(hcmd);
            return true;
        }
        else
        {
            Serial.println("Exact same command is present in the list so we discard the newest one");
        }
#else
        lowPriorityFifoCommandList.push_back(hcmd);
#endif
    }
    else
    {
        Serial.println("maximum FIFO size reached!");
    }
    taskEXIT_CRITICAL(&mutexExpect);

