Smartrek/spidermesh_gateway_esp32/src/spidermeshapi.cpp
    return false;
}


bool SpidermeshApi::addApiPacketHighPriority(apiframe hcmd)
{
    taskENTER_CRITICAL(&mutexExpect);
    if(highPriorityFifoCommandList.size() <= PORTIA_FIFO_HIGH_PRIORITY_SIZE)
    {
    #if ON_DEMAND_COMMAND_MUST_BE_DIFFERENT_FROM_THE_LAST_ONE == 1
        if(hcmd != highPriorityFifoCommandList.back())
        {
            highPriorityFifoCommandList.push_back(hcmd);
        }
    #else
        highPriorityFifoCommandList.push_back(hcmd);
    #endif
        return true;
    }
    taskEXIT_CRITICAL(&mutexExpect);

    return false;
}



void SpidermeshApi::WriteAndExpectAnwser(mesh_t::iterator pNode, apiframe request, uint8_t packet_type, String tag, ExpectCallback cb)
{
    uint max_retry = DEFAULT_MAX_TRY_TO_SEND;
    apiframe expectPayload;
    int16_t size = -1;

    WriteAndExpectAnwser(pNode,request,packet_type,max_retry,expectPayload, size, tag, cb);
}
void SpidermeshApi::WriteAndExpectAnwser(mesh_t::iterator pNode, apiframe request, uint8_t packet_type, uint8_t max_retry, String tag,ExpectCallback cb)
{
    apiframe expectPayload;
    int16_t size = -1;

    WriteAndExpectAnwser(pNode,request,packet_type,max_retry,expectPayload, size, tag, cb);
}

void SpidermeshApi::WriteAndExpectAnwser(  mesh_t::iterator pNode, 
                                    apiframe request, 
                                    uint8_t packet_type,                                      
                                    uint8_t max_retry, 
                                    apiframe expectPayload, 
                                    int16_t size, 
                                    String tag,
                                    ExpectCallback cb)
{
  #if SHOW_EXPECT_EVENT
    Serial.println("SHOW_EXPECT_EVENT");
  #endif
    
    //check if not already exist
    bool found = false;
    for (auto i:listOfExpectedAnswer)
    {
        if ( i._pNode == pNode && i._request == request) found = true;
    }

    #define MAX_EXPECT_LIST 10
    if(!found)
    {
        if(listOfExpectedAnswer.size() < MAX_EXPECT_LIST)
        {


            ExpectAnswer toWaitAnswerElem(pNode, packet_type, request, cb, tag, max_retry, expectPayload, size);
            listOfExpectedAnswer.push_back(toWaitAnswerElem);
            sendCommand(request);
        }
        else PRTLN("MAX_EXPECT_LIST reached");
    }
}
//void SpidermeshApi::





void SpidermeshApi::CheckIfAnswerWasExpectedAndCallSuccessFunction(apiframe rxPkt)
{
  #if SHOW_EXPECT_EVENT
    //Serial.println("CheckIfAnswerWasExpectedAndCallSuccessFunction()");
  #endif    
    //check if there is something to expect
    if(listOfExpectedAnswer.size() > 0)
    {
        std::list<ExpectAnswer>::iterator i = listOfExpectedAnswer.begin();

          #if SHOW_EXPECT_EVENT
            Serial.print("rxPkt: ");
            printApiPacket(rxPkt);
          #endif            


        // for all expected answer recorded
        while (i != listOfExpectedAnswer.end())
        {
            //if packet is local
            if(rxPkt[3] != PACKET_REMOTE_ANSWER)
            {
                if((i->_packet_type | 0x10) == rxPkt[3])
                {
                    #if SHOW_EXPECT_EVENT
                        Serial.println(" = expect local match found ");
                    #endif
                        i->_expect_callback(i->_pNode, rxPkt, true, i->_tag);
                        i=listOfExpectedAnswer.erase(i);
                    #if SHOW_EXPECT_EVENT
                        Serial.println(" = callback done");
                    #endif
    
                        break;
                }
            }
            //since it is remote check the remote packet type futher
            
            else if((i->_packet_type | 0x10) == (rxPkt[6] & 0x7F))
            {
              #if SHOW_EXPECT_EVENT
                Serial.println("  = remote packet match");
              #endif

                //PRTLN("PACKET REMOTE RESP");
                u_mac add_rx;


                add_rx.bOff[byte0]=rxPkt[7];
                add_rx.bOff[byte1]=rxPkt[8];
                add_rx.bOff[byte2]=rxPkt[9];
                add_rx.bOff[byte3]=0;

                //Serial.println("  address cmp:" + String(add_rx.address) + "   exp:" + String(i->_pNode.second.mac.address));
                //if address and packet type match, we found the good one
                
                if(add_rx.address== i->_pNode->second.mac.address)
                {

                    #if SHOW_EXPECT_EVENT
                        Serial.println(" == expect match found");
                    #endif

                    #if MODBUS_REGISTER_ENABLED
                    Helper::PollPacketToModbusRegister(i->_pNode, rxPkt);
                    #endif

                    i->_expect_callback(i->_pNode, rxPkt, true, i->_tag);

                     i->_pNode->second.dataValid = true;
                  #if SHOW_EXPECT_EVENT
                    Serial.println("  data validity TRUE  <----------" + i->_pNode->second.name);
                  #endif

                    i=listOfExpectedAnswer.erase(i);

                    break;
                }
            }

            i++;
        }
    }
}


//rfPayloadToJsonFromPacket(i->_idx);



//a chaque EOB, incrémente les compteur de EOB pour tout les nodes qui attende un message. 
//si il a 2 EOB sans réponse, la meme requete peut etre envoyé de nouveau si le nombre de retry est >0
//apres le nombre de retry sans réponse, le node est considéré comme dead
// 

void SpidermeshApi::CheckExpectTimeout()
{
  #if SHOW_EXPECT_EVENT
    //Serial.println("CheckExpectTimeout()"); delay(100);
  #endif
    
    if(listOfExpectedAnswer.size() > 0)
    {
        
        auto i = listOfExpectedAnswer.begin();

        while (i != listOfExpectedAnswer.end())
        {
            //if timeout, when eob more than 2 is considered timeout
            if( (++i->_eob_cnt) >2)
            {
                //Serial.println("Expect failed, reach max EOB");
                i->_eob_cnt=0;

