Smartrek/spidermesh_gateway_esp32/src/spidermeshapi.cpp
                //retry if less than max allowed and data was valid last time
                //we don't want to retry if it was already dead and waste time here
                apiframe dummy = {};
                #if SHOW_EXPECT_EVENT
                Serial.println("  data validity FALSE <---- " + i->_pNode->second.name);
                #endif
                    i->_pNode->second.dataValid=false;
                i->_expect_callback(i->_pNode, dummy, false, i->_tag);//if user want to do something

                i=listOfExpectedAnswer.erase(i);
            }
            //Serial.print("  expect list sz:");
            //Serial.println(listOfExpectedAnswer.size());
            if(i != listOfExpectedAnswer.end()) i++;
        }
        
    }
                    
}


void SpidermeshApi::automaticNodePolling()
{
    static bool current_focus_cycle = true;
  #if SHOW_AUTOMATIC_POLLING
    Serial.print("automaticNodePolling() mode:");
    Serial.println(polling_mode);
  #endif

    //if there are nodes to poll
    if(nodes.pool.size() > 1) //we check if more than one since gateway is the first
    {
        apiframe smkPacket;
        //bool must_increase_polling_iterator = false;
        mesh_t::iterator pPoll = nodes.pool.end();

        unsigned long seconds = millis()/1000;

        if(focus_node != 0)
        {
            uint64_t toComp = (millis() - focus_node_start_time)/1000;
            if(toComp < _duration_focus_on_node_polling)
            {
              #if SHOW_AUTOMATIC_POLLING
                Serial.print("focus polling on");
                Serial.println(SmkList::mac2String(focus_node));
              #endif          

                //current_focus_cycle allow to toggle 1/2 time on a specific node 
                //while allowing to continue the round robin cycle on the other 1/2 of time
                if(current_focus_cycle)
                {
                    pPoll = find(focus_node);
                    if(pPoll == nodes.pool.end()) current_focus_cycle = false;
                }
                else
                {
                    if(polling_mode == "time" || polling_mode == "fast")
                    {
                        //must_increase_polling_iterator = true;
                        findNext();
                        pPoll = pCurrentNode;
                    }
                    else pPoll != nodes.pool.end();
                    current_focus_cycle = true;
                }
            }

            //expiration of the focus mode, will return to the programmed polling_mode variable
            else
            {
                focus_node=0;   
                Serial.println("exit focus mode");
            }


        }
        else if(polling_mode == "time")
        {
          #if SHOW_AUTOMATIC_POLLING
            Serial.println("time based polling mode");
          #endif          
            
            if(seconds - pCurrentNode->second.elapse_time >= pCurrentNode->second.sample_rate)
            {
                //must_increase_polling_iterator = true;
                findNext();


                pPoll = pCurrentNode;
            }
        }
        else if(polling_mode == "fast")
        {
          #if SHOW_AUTOMATIC_POLLING
            Serial.println("fast based polling mode");
          #endif          
            //must_increase_polling_iterator = true;
            findNext();
            pPoll = pCurrentNode;
        }


        //if the 
        if(pPoll != nodes.pool.end())
        {
            #if SHOW_AUTOMATIC_POLLING
                Serial.println("SHOW_AUTOMATIC_POLLING");
                delay(100);
                Serial.println(pPoll->second.getMacAsString());
                //Serial.printf ("Automatic Polling --> millis   %lu  -  %lu >= %d\n", seconds, pPoll->second.elapse_time, pCurrentNode->second.sample_rate);
            #elif SHOW_MIN_DEBUG
                Serial.print("?");
            #endif
            pPoll->second.elapse_time = seconds;
            String t = pPoll->second.type; 
            apiframe rqt_status;

            //we build the request frame 
            
            
            apiframe user_req_to_append = cbAutoRequestBuilder(pPoll);

            if(user_req_to_append.size() >0) rqt_status = user_req_to_append;
            else if(nodes.getTypeJsonVariant()[t]["command"].containsKey("status"))
                rqt_status.push_back(nodes.getTypeJsonVariant()[t]["command"]["status"]["rqst"].as<byte>());

            //set the address of the node to poll in the transmission buffer
            byte sz = 6 + rqt_status.size();
            smkPacket = {0xFB, sz, 0, 0x0C, 0x00, PACKET_VM_REQUEST};

            smkPacket.push_back(pPoll->second.mac.bOff[0]);
            smkPacket.push_back(pPoll->second.mac.bOff[1]);
            smkPacket.push_back(pPoll->second.mac.bOff[2]);

            //add custom payload from json file if available
            for(auto c : rqt_status) smkPacket.push_back(c);        
            
            if(show_apipkt_out)
                printApiPacket(smkPacket, "  out: ");
            //write the polling command 

            WriteAndExpectAnwser(pPoll, smkPacket, 0x0E, "status", cbAutomaticPolling);
        }
        /*
        if(must_increase_polling_iterator)
        {
            pCurrentNode++;
            if(pCurrentNode == nodes.pool.end()) pCurrentNode = nodes.pool.begin();
        }
        */

    }
    //else Serial.println();
}


bool SpidermeshApi::enableAutomaticPolling(String mode,String mac, uint16_t duration){
    bool ret = true;


    if(mode == "focus")
    {
        _duration_focus_on_node_polling = duration;
        focus_node_start_time=millis();
        if(!setFocusMode(mac))
        {   
            focus_node = 0;
            ret = false;
        }
        if(focus_node)
        {
            Serial.print("enter focus mode for ");
            Serial.print(duration);
            Serial.print("   _dur= ");
            Serial.println(_duration_focus_on_node_polling);
        }
    }
    else if (mode != "time" || mode != "fast")
    {
        
        polling_mode = mode; //default mode
        setAutoPolling(true);
    }
    else if (mode == "disabled" || readFile("pollingMode") == "disabled")
    {
        setAutoPolling(false);
    }
    return ret;
}

#define DEBUG_FINDNEXT false
bool SpidermeshApi::findNext(bool onlyRemote, bool initSearch)
{
	bool ret = false;
	mesh_t::iterator next = pCurrentNode;

    #if DEBUG_FINDNEXT
    if(nodes.pool.size() <= 1)
    {
        Serial.println("no node, so can't find next");
    }
    Serial.println("find next start");
    #endif

	if (initSearch)
	{
        #if DEBUG_FINDNEXT
        Serial.println("Init search");
        #endif
		next = nodes.pool.begin();
	}
	else next++;

