Smartrek/spidermesh_gateway_esp32/src/spidermeshapi.cpp
	int nbCheck = 0;
	while (nbCheck < nodes.pool.size())
	{
		if (next == nodes.pool.end()) next = nodes.pool.begin();

        if(onlyRemote && next->second.local){
            #if DEBUG_FINDNEXT
            Serial.println("Local so search next");
            Serial.println(next->second.getMacAsString());
            #endif
            next++;
        } 
        else {
            pCurrentNode = next;
            #if DEBUG_FINDNEXT

            Serial.print("mac found is: ");
            Serial.println(next->second.getMacAsString());
            #endif
            ret = true; 
            break;
        };
        nbCheck++;
	}

    #if DEBUG_FINDNEXT
    if(!ret)
    {
        Serial.println("No node found");
    }
    Serial.println("find next end");
    #endif

	return ret;
}


apiframe SpidermeshApi::apiPacket(uint8_t cmd, apiframe pkt, bool local, bool broadcastOtaUpdate, uint8_t phase)
{

    if(!local)
    {
        cmd |=0x80;
        if(broadcastOtaUpdate) cmd |=0x40;
        if(!broadcastOtaUpdate)
        {
            pkt.insert(pkt.begin(), pCurrentNode->second.mac.bOff[byte2]);
            pkt.insert(pkt.begin(), pCurrentNode->second.mac.bOff[byte1]);
            pkt.insert(pkt.begin(), pCurrentNode->second.mac.bOff[byte0]);
            
        }
        pkt.insert(pkt.begin(), cmd);
        pkt.insert(pkt.begin(), phase);
        pkt.insert(pkt.begin(), 0x0C); //wrapper
    }
    else
    pkt.insert(pkt.begin(), cmd);

    int len = pkt.size();
    pkt.insert(pkt.begin(), 0);
    pkt.insert(pkt.begin(), len);
    pkt.insert(pkt.begin(), 0xFB);

    if(show_apipkt_out)
        printApiPacket(pkt, PREFIX_OUT);
    return pkt;
}

apiframe SpidermeshApi::apiPacket(mesh_t::iterator pNode, uint8_t cmd, apiframe pkt, bool local, bool broadcastOtaUpdate, uint8_t phase)
{
    if(!local)
    {
        cmd |=0x80;
        if(broadcastOtaUpdate) cmd |=0x40;
        if(!broadcastOtaUpdate)
        {
            pkt.insert(pkt.begin(), pNode->second.mac.bOff[byte2]);
            pkt.insert(pkt.begin(), pNode->second.mac.bOff[byte1]);
            pkt.insert(pkt.begin(), pNode->second.mac.bOff[byte0]);
            
        }
        pkt.insert(pkt.begin(), cmd);
        pkt.insert(pkt.begin(), phase);
        pkt.insert(pkt.begin(), 0x0C); //wrapper
    }
    else
    pkt.insert(pkt.begin(), cmd);

    int len = pkt.size();
    pkt.insert(pkt.begin(), 0);
    pkt.insert(pkt.begin(), len);
    pkt.insert(pkt.begin(), 0xFB);

    printApiPacket(pkt, PREFIX_OUT);
    return pkt;
}
